In [1]:
import pandas as p

data1 = {
    'id' : [1,2,3,4,5],
    'data':['abc','bcd','cdh','dhi','hij']
}

data2 = {
    'id' : [6,4,3,1,7],
    'data':['ijk','jkl','klm','lmn','mno']
}

data3 = {
    'id' : [8,9,10,11,12],
    'data':['nop','opq','pqr','qrs','rst']
}

df1 = p.DataFrame(data1)
df2 = p.DataFrame(data2)
df3 = p.DataFrame(data3)

### Concatenation

In [4]:
df_concat = p.concat([df1,df2],axis=0)
df_concat

   id data
0   1  abc
1   2  bcd
2   3  cdh
3   4  dhi
4   5  hij
0   6  ijk
1   4  jkl
2   3  klm
3   1  lmn
4   7  mno

In [3]:
df_concat = p.concat([df1,df2],axis=1)
df_concat

   id data  id data
0   1  abc   6  ijk
1   2  bcd   4  jkl
2   3  cdh   3  klm
3   4  dhi   1  lmn
4   5  hij   7  mno

### Fusion ou Jointure

In [5]:
df_merge = p.merge(df1,df2,on='id')
df_merge

   id data_x data_y
0   1    abc    lmn
1   3    cdh    klm
2   4    dhi    jkl

In [8]:
df_merge = p.merge(df1,df2,left_on='id',right_on='id')
df_merge

   id data_x data_y
0   1    abc    lmn
1   3    cdh    klm
2   4    dhi    jkl

In [9]:
df_merge_outer = p.merge(df1,df2,on='id',how='outer')
df_merge_outer

   id data_x data_y
0   1    abc    lmn
1   2    bcd    NaN
2   3    cdh    klm
3   4    dhi    jkl
4   5    hij    NaN
5   6    NaN    ijk
6   7    NaN    mno

In [11]:
df_merge_outer_left = p.merge(df1,df2,on='id',how='left')
df_merge_outer_left

   id data_x data_y
0   1    abc    lmn
1   2    bcd    NaN
2   3    cdh    klm
3   4    dhi    jkl
4   5    hij    NaN

In [12]:
df_merge_outer_rigth = p.merge(df1,df2,on='id',how='right')
df_merge_outer_rigth

   id data_x data_y
0   1    abc    lmn
1   3    cdh    klm
2   4    dhi    jkl
3   6    NaN    ijk
4   7    NaN    mno

In [13]:
df12 = p.merge(df1,df2,on='id', how='outer')

In [14]:
df12

   id data_x data_y
0   1    abc    lmn
1   2    bcd    NaN
2   3    cdh    klm
3   4    dhi    jkl
4   5    hij    NaN
5   6    NaN    ijk
6   7    NaN    mno

In [15]:
df123 = p.merge(df12,df3,on='id',how='outer')

In [16]:
df123

    id data_x data_y data
0    1    abc    lmn  NaN
1    2    bcd    NaN  NaN
2    3    cdh    klm  NaN
3    4    dhi    jkl  NaN
4    5    hij    NaN  NaN
5    6    NaN    ijk  NaN
6    7    NaN    mno  NaN
7    8    NaN    NaN  nop
8    9    NaN    NaN  opq
9   10    NaN    NaN  pqr
10  11    NaN    NaN  qrs
11  12    NaN    NaN  rst